Revit 2027 API
DirectShapeReferenceOptions.IsValidExternalGeometryId Method
 Validates that the input ExternalGeometryId can be assigned to a direct shape reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidExternalGeometryId(
	ExternalGeometryId externalId
)
Public Shared Function IsValidExternalGeometryId (
	externalId As ExternalGeometryId
) As Boolean
public:
static bool IsValidExternalGeometryId(
	ExternalGeometryId^ externalId
)
static member IsValidExternalGeometryId :
        externalId : ExternalGeometryId -> bool
Parameters
externalId ExternalGeometryId
 The ExternalGeometryId to assign to the reference.
Return Value
Boolean
 True if the provided ExternalGeometryId is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace